---
kind: property
id: P:Autodesk.Revit.DB.Ellipse.Center
source: html/5933fb28-ed77-c59d-6732-78200171f143.htm
---
# Autodesk.Revit.DB.Ellipse.Center Property

Returns the center of the ellipse.

## Syntax (C#)
```csharp
public XYZ Center { get; }
```